// main.cpp - sharp lcd testbed
//{{{  includes
#include "common/utils.h"
#include "common/cPointRect.h"
#include "common/font.h"

#include "stm32f4xx.h"
#include "audio.h"
#include "ledsButton.h"
#include "accelerometer.h"
//}}}
#define BIG
const uint8_t kFirstMask[8] = { 0xFF, 0x7F, 0x3F, 0x1F, 0x0f, 0x07, 0x03, 0x01 };
const uint8_t kLastMask[8] =  { 0x80, 0xC0, 0xE0, 0xF0, 0xF8, 0xFC, 0xFE, 0xFF };

//{{{  struct WAVE_FormatTypeDef
struct WAVE_FormatTypeDef {
  uint32_t   ChunkID;       // 0
  uint32_t   FileSize;      // 4
  uint32_t   FileFormat;    // 8
  uint32_t   SubChunk1ID;   // 0x0c
  uint32_t   SubChunk1Size; // 0x10

  uint16_t   AudioFormat;   // 0x14
  uint16_t   NbrChannels;   // 0x16
  uint32_t   SampleRate;    // 0x18
  uint32_t   ByteRate;      // 0x1C
  uint16_t   BlockAlign;    // 0x20
  uint16_t   BitPerSample;  // 0x22

  uint32_t   SubChunk2ID;   // 0x24
  uint32_t   SubChunk2Size; // 0x28
  };                        // 0x2C len
//}}}
WAVE_FormatTypeDef* waveFormat;
uint16_t* waveData;

//{{{
class cLcd {
public:
  //{{{  defines
  //    xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
  //    x  GND   EXTMODE   5v   VCOM   MOSI   3.3v  x
  //    x  GND     5v     DISP   CS    SCLK    GND  x
  //xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx

  #define SCK_PIN        GPIO_PIN_13  //  SPI2  PB13  SCK
  #define MOSI_PIN       GPIO_PIN_15  //  SPI2  PB15  MOSI
  #define CS_PIN         GPIO_PIN_12  //  SPI2  PB12  CS/NSS active hi
  #define DISP_PIN       GPIO_PIN_14  //  GPIO  PB14  DISP active hi, disp_pwm
  #define VCOM_PIN       GPIO_PIN_11  //  GPIO  PB11  VCOM - TIM2 CH4 1Hz flip
  #define LCD_POWER_PIN  GPIO_PIN_8   //  GPIO  PD8   LCD_POWER

  #define paddingByte 0x00
  #define clearByte   0x20 // unused
  #define vcomByte    0x40 // unused
  #define commandByte 0x80

  #define POLY_X(Z)  ((int32_t)((points + Z)->x))
